Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །སྐུ་མཁྲེགས་སྟོབས་མཆོག་ལྡན་པ་ནི།
en: His strong body, which is imbued with supreme power,

source: །རི་བོ་བཞིན་དུ་ཤིན་ཏུ་གནས།
en: Is well established just like a rocky mountain.

source: །རྙེད་དང་མ་རྙེད་བདེ་སྡུག་དང་། །སྨད་པ་དང་ནི་བསྟོད་པ་དང་། །གྲགས་པ་དང་ནི་མ་གྲགས་པས།
en: “He is not polluted by acquisition or nonacquisition, Pleasure or suffering, blame or praise, Honor or dishonor,

source: །ཆུ་ཡིས་པད་མ་བཞིན་མ་གོས།
en: Just as the lotus blossom is not polluted by water.

source: །སྲོག་གཅོད་པ་ནི་རྣམ་སྤངས་ཏེ།
en: “He abstains from killing.

source: །མ་བྱིན་པ་ལ་དགའ་མི་བྱེད།
en: He does not desire what is not given.

source: །བདེན་པ་གསུང་ཞིང་ཚངས་པར་སྤྱོད།
en: Speaking truth, leading a pure life,

source: །དེ་ནི་ཕྲ་མ་སྤངས་པ་ཡིན།
en: He is free from backbiting.

source: །ཚིག་རྩུབ་དག་ནི་མི་གསུང་ཞིང་།
en: “He does not speak coarse words

source: །དུས་སུ་བབ་པ་འཇམ་པོར་གསུང་།
en: But speaks gently, in a timely way.

source: །དེ་ནི་འདོད་ལ་བརྣབ་སེམས་མེད།
en: He does not seek the objects of desire

source: །སྐྱེ་བོ་རྣམས་ལ་དེ་སེམས་བྱམས།
en: But has thoughts of love for people.

source: །ཡང་དག་ལྟ་བ་ཕུན་སུམ་ཚོགས།
en: “He is perfect in seeing correctly

source: །ཏིང་ངེ་འཛིན་སྟོབས་སྤྱོད་ཡུལ་བ།
en: And exercises the power of meditation.

source: །བསམ་གཏན་ཆེན་པོ་མངོན་ཤེས་དྲུག །རྫུ་འཕྲུལ་གྱིས་ནི་མཁའ་ལ་གཤེགས།
en: This great meditator with the six kinds of supernormal knowledge Courses through the sky with his magical power. “He hears the voices

source: །ལྷ་དང་མི་ཡི་སྒྲ་དག་ནི། །གང་ཡིན་རྣམ་པ་སྣ་ཚོགས་གསན། །ཉོན་མོངས་ཅན་ནམ་དགེ་ཡང་རུང་།
en: Of various gods and humans

source: །ཕ་རོལ་གྱི་ནི་སེམས་ཀྱང་མཁྱེན།
en: And also knows others’ minds, Whether they are impure or good. “He knows past lives,

source: །གང་དང་གང་དུ་སྔོན་གནས་པ།
en: Where he once lived,

source: །སྔོན་གྱི་གནས་ལ་མཁས་པ་དང་། །སེམས་ཅན་འགྲོ་དང་འོང་བ་ཡི།
en: And knows beings’ comings and goings,

source: །འཆི་འཕོ་དང་ནི་སྐྱེ་བ་མཁྱེན།
en: That is, death and birth.

source: །ཟག་པ་ཟད་ཅིང་མི་ལྡན་པས།
en: “Having had his impurities exhausted, not retaining any of them,

source: །ཉེར་ཞི་ཤིན་ཏུ་མྱ་ངན་འདས།
en: Pacified and emancipated,

source: །དབང་པོ་ཞི་ཞིང་ཐུགས་ཞི་བ། །མཚོ་ནི་གང་བ་བཞིན་དུ་གནས།
en: With his faculties and mind pacified, He is just like a still pond full of water. “If you see him, who is like an excellent sixty-year-old elephant

source: །པད་མའི་རྫིང་ན་གླང་པོ་ཆེ། །དམ་པ་དྲུག་བཅུ་ལོན་པ་ལྟར།
en: In a lotus pond,

source: །མཐོང་ན་ངོམས་ནི་མི་ཤེས་པས།
en: You, brahmin, who are insatiable,

source: །བྲམ་ཟེ་དགའ་བ་ཐོབ་པར་འགྱུར།
en: Will attain joy.

source: །རི་བོ་བཅོམ་ལྡན་འདི་འདྲ་སྟེ།
en: “Śaila, the Blessed One is such a one.

source: །དེ་ཡི་སྐུ་ནི་སྐྱེས་ཆེན་གྱི། །སུམ་བཅུ་རྩ་གཉིས་མཚན་མངའ་ཞིང་།
en: His body bears the thirty-two marks Of a great man,

source: །གཟི་བརྗིད་མེ་ཡི་ཕུང་པོ་བཞིན།
en: And his splendor is like a mass of fire. “Even if someone praised

source: །གང་གིས་ལོ་བརྒྱ་ཚང་བར་ནི། །སྐྱོབ་པའི་བསྔགས་པ་བརྗོད་བྱས་ཀྱང་།
en: The Protector for a hundred years,

source: །དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པས། །དེས་ནི་མཐར་ཕྱིན་མི་འགྱུར་རོ།
en: He would not reach the end Because the Tathāgata is immeasurable.

source: །བྲམ་ཟེ་གང་གིས་དེ་མཐོང་བ།
en: “Brahmin, those who see him

source: །དེ་ཡི་རྙེད་པ་བླ་ན་མེད།
en: Attain supreme merit.

source: །གང་གིས་མཐོང་བས་སྐྱབས་སོང་བ།
en: And those who see him and seek refuge in him

source: །དེ་ཡི་རྙེད་པ་དེ་བས་འཕགས།
en: Attain merit superior to that.”

source: །བྲམ་ཟེ་རི་བོས་ཐུབ་ཆེན་གྱི། །བསྔགས་པ་ཐོས་ནས་སྐྱོ་བར་གྱུར།
en: Having heard this praise of the Great Muni,

source: །དབེན་པའི་སེམས་ཀྱི་རྟོག་པ་ཡིས།
en: The ṛṣi Śaila was moved

source: །ཀ་ནའི་བུ་ལ་འདི་སྐད་སྨྲས།
en: And said to Kaineya,

source: །མིར་གྱུར་པ་ལ་བདག་གིས་ནི།
en: His mind seeking solitude,

source: །དེ་འདྲའི་བསྔགས་པ་ཐོས་མ་མྱོང་།
en: “I have never heard Such praise of a human being.

source: །ཀེ་ན་འཆད་པ་དང་སྦྱར་ན།
en: O Kaineya, according to your explanation,

source: །དེ་ནི་འཇིག་རྟེན་ཀུན་གྱི་གཙོ།
en: He is the best in the whole world.”

source: །ཚོང་པ་ནོར་དག་དོན་གཉེར་ལྟར།
en: “Just like a merchant seeking wealth,

source: །ཁྱོད་ཀྱིས་ང་རྒྱལ་རྒྱལ་མཚན་སྤོངས།
en: You should abandon the banner of pride.

source: །དེ་ལ་བཀུར་སྟི་གུས་བྱོས་དང་། །བྲམ་ཟེ་དགའ་བ་ཐོབ་པར་འགྱུར།
en: Respect and worship him And thus, brahmin, you will attain joy.”

source: །བྲམ་ཟེ་ཁྱེའུ་ནི་ལྔ་བརྒྱ་ཡིས།
en: Served by five hundred young brahmins

source: །སློབ་མ་དག་གིས་མདུན་བདར་ཏེ།
en: Who were his pupils, The brahmin Śaila went

source: །སངས་རྒྱས་བཞུགས་པ་བཟང་པོ་དེར།
en: To the pleasant place of the Buddha’s sojourn.

source: །བྲམ་ཟེ་རི་བོ་སོང་བར་གྱུར།
en: Thereupon the brahmin entered

source: །ལྷ་རྣམས་ཀྱི་ནི་དགའ་ཚལ་ལྟར།
en: The dwelling of the king of the Dharma,

source: །མེ་ཏོག་ཤིང་ནི་ཕུན་སུམ་ཚོགས།
en: Which was abundant in trees bearing blossoms Just like the gods’ Nandana Grove,

source: །རྣམ་པར་དབེན་ཞིང་སྒྲ་མེད་ཅིང་།
en: Which was solitary and quiet

source: །བྱ་ཡི་ཚོགས་ཀྱིས་བསྟེན་གྱུར་པ།
en: And visited by flocks of birds,

source: །མི་མིན་གདུག་པ་མི་རྒྱུ་བ།
en: And which was not haunted by harmful kinnarīs

source: །ཤཱཀྱའི་སྲས་ཀྱིས་བསྟེན་པ་ཡི། །ཆོས་ཀྱི་རྒྱལ་པོའི་གནས་སུ་ནི། །དེ་ནས་བྲམ་ཟེས་ཞུགས་པར་གྱུར། །མ་དུལ་འདུལ་བ་ཁ་ལོ་སྒྱུར། །སྐྱེས་བུ་དམ་པ་མཐོང་ནས་ནི།
en: But was visited by sons of the Śākyans. Having seen the most excellent man, The one who trains those who have not been trained,

source: །རི་བོ་ཡིས་ནི་ཚིག་གསོལ་པ།
en: Śaila spoke these words:

source: །ཤེས་ལྡན་ཅིག་སྙུན་མི་མངའམ།
en: “Sir, are you free from illness?”

source: །ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་ཅན། །སངས་རྒྱས་སྙན་ཅིང་གསལ་བའི་བཀས།
en: The Buddha, who had a pleasant voice like the kalaviṅka bird,

source: །རི་བོ་ལ་ནི་སླར་གསུངས་པ།
en: Answered Śaila With sweet and clear words:

source: །ང་ལ་ནད་ནི་ཡོད་མིན་ཏེ།
en: “Indeed, I am free from illness.

source: །ཉེས་པ་མེད་ཅིང་སྡིག་པ་མེད།
en: “Free from stains or evils,

source: །ཐེ་ཚོམ་ཐམས་ཅད་རྣམ་པར་ཆད།
en: Having cut off all uncertainty,

source: །རྣམ་པར་གྲོལ་ཞིང་མི་ལྡན་པ།
en: Liberated, possessed of nothing,

source: །ང་ནི་ཟག་མེད་ཐ་བ་མེད།
en: I am untainted and free from rigidity.

source: །འཇིག་རྟེན་ན་ནི་རྡུལ་མེད་རྒྱུ།
en: “Free from dust, I wander the world.

source: །གཙང་ཞིང་དག་ལ་དྲི་ང་མེད།
en: I am pure, clean, and taintless.

source: །དེས་ན་བྲམ་ཟེ་ང་གཙང་སྟེ།
en: Thus, brahmin, I am pure

source: །ཁོན་དང་འཇིགས་པ་ཀུན་ལས་རྒལ།
en: And have overcome all anger and fear.

source: །རི་བོ་ཁྱོད་ཀྱང་འོངས་པ་ལེགས།
en: “Welcome, Śaila.

source: །སྟན་འདི་ལ་ནི་ལེགས་པར་འདུག །བྲམ་ཟེ་ཅི་ག་བདེ་འམ་ཁྱོད།
en: Sit down on this seat. Brahmin, are you happy?

source: །ལུས་ནི་ངལ་བར་མ་གྱུར་མོད།
en: Is your body not tired?” “I am happy today because,

source: །དཔའ་བོ་ཆེན་པོ་ཁྱོད་མཐོང་བས།
en: O Great Hero, I see you, Great Muni.

source: །ཐུབ་པ་ཆེན་པོ་ད་ལྟར་བདེ།
en: My heart is delighted

source: །རྒྱན་རྣམས་ཀྱིས་ནི་བརྒྱན་པ་ལྟར། །ཡིད་ནི་རབ་ཏུ་དགའ་བ་ཡིས།
en: As if bedecked with adornments.”

source: །དེ་དང་རྗེས་སུ་འཚམ་པའི་གཏམ།
en: Having exchanged the proper

source: །རིམ་པ་བཞིན་དུ་བྱས་ནས་ནི།
en: Series of pleasantries with him,

source: །དེ་ནས་བྲམ་ཟེ་འཛེམ་པ་དང་། །དམན་པའི་ཡིད་ཀྱིས་འདུག་པར་གྱུར།
en: The brahmin then sat down, His mind humble and modest. Having sat down, the brahmin Śaila,

source: །ཀློག་པ་དང་ནི་གསང་ཚིག་འཛིན།
en: Who was a holder of recitations and mantras

source: །རིག་བྱེད་གསུམ་གྱི་རིག་མཐར་ཕྱིན། །བྲམ་ཟེ་རི་བོ་འདུག་ནས་ནི།
en: And was familiar with the three kinds of Vedic knowledge,

source: །ཐུབ་པའི་མཚན་ལ་རྟོག་པར་བྱེད།
en: Observed the Muni’s marks. He saw thirty marks

source: །འཇིག་རྟེན་གྱི་ནི་མགོན་པོ་ཡི།
en: On the body of the Protector of the World.

source: །སྐུ་ལ་མཚན་ནི་སུམ་བཅུ་མཐོང་།
en: Śaila had doubts about the other two,

source: །ལྗགས་སྲབ་མདོམས་སྦ་སྦུབས་ནུབ་པ།
en: Namely, the narrow tongue and the private part hidden in a sheath.

source: །གཉིས་ལ་རི་བོ་ཐེ་ཚོམ་ཟ།
en: Having become uncertain and unsettled

source: །ཐུབ་པ་ཆེན་པོའི་མཚན་རྣམས་ལ། །ཐེ་ཚོམ་ཡིད་གཉིས་གྱུར་ནས་ནི།
en: About the marks of the Great Muni,

source: །རྫོགས་པའི་སངས་རྒྱས་ཉི་མའི་རིགས། །བདེན་པའི་མཆན་ལ་ཡོངས་ཞུས་པ།
en: He asked the Perfectly Awakened One, The descendant of the sun, whose name was truth,

source: །ཐུབ་པ་ཆེན་པོའི་མཚན་རྣམས་ནི།
en: “The marks of a Great Muni

source: །སུམ་བཅུ་རྩ་གཉིས་ཐོབ་པ་གང་།
en: Are thirty-two.

source: །གཽ་ཏམ་ཁྱོད་ཀྱིས་སྐུ་དག་ལ།
en: I have not seen, O Gautama,

source: །གཉིས་ནི་གཡར་སྔར་མ་བབ་བོ།
en: Two of them on your body.

source: །མི་ཡི་དམ་པ་མདོམས་ཀྱི་ནི།
en: “O best of men, is your private part

source: །སྦ་བ་སྦུབས་སུ་ནུབ་ལགས་སམ།
en: Hidden in a sheath?

source: །ཅི་ག་ཐུང་བ་མ་ལགས་གྲང་།
en: Really long?

source: །ཐུབ་ཆེན་བདག་གིས་ཅི་ནས་ཀྱང་།
en: “O Great Muni, by all means

source: །ལྗགས་རིང་གློ་བར་ཆུད་འགྱུར་བ།
en: I must be convinced of your long tongue.

source: །ལྗགས་སྲབ་མྱུར་དུ་བརྐྱང་མཛད་དེ།
en: Please dart your narrow tongue out of your mouth

source: །བདག་གི་ཐེ་ཚོམ་བསལ་དུ་གསོལ།
en: And clear up my doubts. “It is seldom that Guides

source: །རྣམ་པར་འདྲེན་རྣམས་འཇིག་རྟེན་དུ།
en: Appear in the world.

source: །བརྒྱ་ལམ་ན་ནི་ལན་འགའ་འབྱུང་།
en: A Great Muni is scarcely met,

source: །ཨུ་དུམ་བཱ་རིའི་མེ་ཏོག་བཞིན།
en: Just like the udumbara flower.

source: །ཐུབ་པ་ཆེན་པོ་དཀོན་པ་ལགས།
en: “We serve the Teacher

source: །སོས་ཀ་སྐམ་པ་ཆབ་དང་ནི།
en: Just as thirsty ones seek water in summer,

source: །བཀྲེས་པ་ལ་ནི་གཡར་ཟས་དང་། །ནད་པ་སྨན་ལ་ཇི་ལྟ་བར། །སྟོན་པ་ལ་ནི་བཀུར་སྟི་བགྱིད།
en: Hungry ones food, And sick ones medicines.”

source: །བྲམ་ཟེ་ཐེ་ཚོམ་སྤང་བར་གྱིས།
en: “Brahmin, remove your uncertainty.”

source: །ལྗགས་ཀྱིས་སྤྱན་དང་སྙན་དག་ནི།
en: He covered his whole face

source: །རབ་ཏུ་ཁེབས་པར་ལྗགས་རིང་གིས།
en: With his long tongue,

source: །ཞལ་གྱི་དཀྱིལ་འཁོར་ཁེབས་པར་མཛད།
en: So that the tongue Covered his eyes and ears.

source: །རྫུ་འཕྲུལ་བཞི་ལ་མཁས་པ་ཡིས།
en: And when he, who is skilled in four kinds of magical power,

source: །རྫུ་འཕྲུལ་གྱིས་ཀྱང་བསྟན་མཛད་པས། །ཐུབ་པའི་མདོམས་སྦ་སྦུབས་ནུབ་པ།
en: Displayed it with his magical power,

source: །བྲམ་ཟེ་རི་བོས་མཐོང་བར་གྱུར།
en: The brahmin Śaila saw

source: །ཐུབ་པ་ཆེན་པོས་མཚན་རྣམས་ལ།
en: The Muni’s private part hidden in a sheath.

source: །ཐེ་ཚོམ་མེད་ཅིང་ཟུག་རྔུ་ཕྱུང་།
en: When he was freed from such doubts About the Great Muni’s marks, and his distress was gone,

source: །སེམས་ཀྱི་རྟོག་པ་རབ་དགའ་ནས།
en: Śaila’s mind was pleased

source: །སུམ་བཅུ་གཉིས་དང་དཔེ་བྱད་རྣམས། །བདག་གིས་གསང་ཚིག་ལས་ཐོས་པ།
en: Of the thirty-two marks.

source: །དེ་ཀུན་ཁྱོད་ཀྱི་སྐུ་འདི་ལ།
en: All of them appear here on your body,

source: །ཡོངས་སུ་རྫོགས་ཏེ་མ་ཚང་མེད།
en: Perfectly, nothing lacking.

source: །དགེ་དང་ལྡན་པས་སྤྱོད་པ་བཟང་།
en: “Virtuous, excellent in conduct,

source: །ལེགས་པར་འཁྲུངས་པས་བལྟ་ན་སྡུག །ཉན་ཐོས་དགེ་འདུན་དབུས་ན་ནི། །གདུགས་བདལ་བ་ནི་ལྟ་བུར་མཛེས།
en: Well born, pleasant to behold, You are beautiful just like the sun, In the middle of the community of disciples. “What use is the state of a śramaṇa

source: །དམ་པར་བསྔགས་པ་ཁྱོད་ལ་ནི། །དགེ་སྦྱོང་དངོས་པོས་ཅི་ཞིག་བགྱི།
en: For you, who are the most praised?

source: །མི་ཡི་ཁྱུ་མཆོག་ཁྱོད་ལྟ་བུ།
en: A man like you, bull among men, Is suitable to be a wheel-turning king,

source: །དཔུང་གི་ཡན་ལག་བཞི་དག་དང་། །རིན་ཆེན་བདུན་དང་ལྡན་པ་ཡི། །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འོས།
en: “Possessor of seven treasures And an army consisting of four divisions.

source: །ས་བདག་རྒྱལ་པོ་མཛད་ནས་ནི།
en: Be the master of the earth, a king,

source: །ས་སྟེང་འཁོར་ལོས་སྒྱུར་བར་མཛོད།
en: And turn the chakra over the earth!”

source: །རི་བོ་ང་ནི་རྒྱལ་པོ་སྟེ།
en: “Śaila, I am a king—that is,

source: །ཆོས་ཀྱི་རྒྱལ་ཆེན་བླ་ན་མེད།
en: The supreme great king of the Dharma.

source: །ང་ནི་ས་ཡི་དཀྱིལ་འཁོར་འདིར། །ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་བྱེད།
en: I turn the chakra of the Dharma Over this entire earth.

source: །ང་ཡི་རིགས་ནི་རྒྱལ་རིགས་ཏེ།
en: “My family is kṣatriya.

source: །ང་ནི་དགེ་བའི་རིག་ལས་འཁྲུངས།
en: I was born into a family of virtue.

source: །བདུད་དཔུང་བཅས་པར་བཅོམ་ནས་ནི།
en: Having defeated Māra with his army,

source: །རྫོགས་པའི་བྱང་ཆུབ་དམ་པ་ཐོབ།
en: I attained the most excellent, perfect awakening.

source: །བྲམ་ཟེ་ངའི་དྲན་འཁོར་ལོ་སྟེ།
en: “Brahmin, my mindfulness is a chakra.

source: །ང་ཡི་ཤེས་རབ་བློན་པོ་ཡིན།
en: My wisdom is a minister.

source: །བརྩོན་འགྲུས་ཤུགས་མགྱོགས་རྟ་ཕོ་ནི། །བཏང་ན་དང་ལ་འབྱུང་བ་ཡིན།
en: A swift horse, which is effort, Spurred, trots forth delightedly.

source: །ང་ཡི་ནོར་བུ་དམ་པ་ནི།
en: “My best jewel is meditation,

source: །ཏིང་འཛིན་མུན་པ་གསལ་བྱེད་ཡིན།
en: Which illuminates the darkness.

source: །བཏང་སྙོམས་གླང་ཆེན་དམ་པ་སྟེ།
en: Equanimity is the best elephant, which,

source: །བསྐུལ་ན་དང་ལ་རྒྱུག་པ་ཡིན།
en: Urged on, runs delightedly.

source: །ཆགས་བཅས་བུད་མེད་འདོད་པ་ལྟར།
en: “Just as women are a pleasure for enamored ones,

source: །བྲམ་ཟེ་ངའི་དགའ་འདོད་པ་ཡིན།
en: Brahmin, joy is my pleasure.

source: །བྲམ་ཟེ་ང་ཡི་ཁྱིམ་བདག་ནི།
en: Brahmin, my householder is

source: །ཤིན་ཏུ་སྦྱངས་ནོར་དམ་པ་ཡིན།
en: The fully purified state, which is the best wealth.

source: །ང་ཡི་བྱང་ཆུབ་ཡན་ལག་བདུན།
en: “With my seven limbs of awakening,

source: །འཇིག་རྟེན་ཀུན་འདས་རིན་ཆེན་དེས།
en: These treasures that surpass the entire world, I will awaken these humans

source: །ལོང་བར་གྱུར་ཅིང་གཉིད་ལོག་པའི། །སྐྱེ་དགུ་འདི་དག་སད་པར་བྱ།
en: Who are blind and asleep.

source: །ཕྱོགས་རྣམས་ཀུན་ནས་ང་རྒྱལ་བས།
en: “As I have conquered every direction,

source: །ང་ལ་སྡོ་བའི་དགྲ་ཡོད་མིན། །ཉོན་མོངས་ཚོགས་རྣམས་འཇོམས་པ་ཡི། །འཁོར་བཞི་པོ་དག་ང་ཡི་སྲས།
en: There are none who match me. The four groups of followers, Who conquer the mass of defilements, are my children. “In the city visited by ancient buddhas,

source: །རྫུ་འཕྲུལ་ཀུན་དགའ་ཕུན་སུམ་ཚོགས།
en: Which is furnished with a park, which is magical power,

source: །ལམ་གྱི་བཞི་མདོར་སྤྲུལ་པ་བྱས།
en: In which a crossroads, which is the path, has been built

source: །མདོ་སྡེ་སྐྱེས་པའི་རབས་དག་བཀྲམ།
en: And sūtras and jātakas are scattered,

source: །སྐྱེས་བུ་ཆེན་པོ་རྣམས་ཀྱིས་སྟེན།
en: Which is visited by great men,

source: །རྣམ་ཐར་གསུམ་གྱི་སྒོ་མོ་ཅན།
en: “Which is equipped with the three gates of liberation

source: །དྲན་པའི་སྲུང་མ་རྣམས་ཀྱིས་བསྲུངས།
en: And guarded by guards who are mindfulness,

source: །ངོ་ཚ་ཁྲེལ་ཡོད་ཀྱིས་གཡོགས་པའི། །གྲོང་ཁྱེར་སྔོན་གྱི་སངས་རྒྱས་ཀྱིས།
en: Which fully possesses conscience and a sense of shame,

source: །བསྟེན་པ་དག་ཏུ་དེ་བཞིན་གཤེགས། །རྒྱལ་པོ་ང་ནི་བཞུགས་ནས་སུ།
en: I, the Tathāgata, the king, dwell.

source: །ང་ཡི་ཆོས་ཀྱི་གཡུལ་སྤྲད་དེ།
en: “I fought the battle of the Dharma.

source: །ཆོས་ཀྱི་རྔ་བོ་ཆེ་བརྡུངས་ནས།
en: Beating the drum of the Dharma,

source: །བདུད་རྣམས་མཐའ་དག་བཅོམ་བྱས་ཏེ།
en: I defeated all Māras.

source: །ང་ནི་བྱང་ཆུབ་ཕྱིར་དབང་བསྐུར།
en: I was anointed as a king for the purpose of awakening.

source: །ཚད་མེད་པ་དག་རབ་བསྒོམས་པ།
en: “The immeasurable states of mind, practiced well,

source: །ང་ཡི་རྒྱན་དུ་བདོག་པ་ཡིན།
en: Are my adornments.

source: །ཚངས་པའི་གནས་པ་བཞི་པོ་ཡིས།
en: The four pure abodes

source: །ཉོན་མོངས་པ་དག་རབ་ཏུ་བཟློག །ཕ་རོལ་རབ་ཏུ་རྒོལ་བཅོམ་སྟེ།
en: Prevent defilements. “Having defeated, destroyed, And scattered other teachings,

source: །རྣམ་པར་བཅོམ་ཞིང་རྨེག་མེད་བྱས།
en: I behave rightly,

source: །སྲོག་ཆགས་རྣམས་ལ་འཇིག་རྟེན་འདིར། །སྣང་བ་སྦྱིན་ཞིང་ཡང་དག་སྤྱད།
en: Giving light to beings in this world.

source: །ང་ནི་བདེ་བར་གནས་བཅས་ནས།
en: “Maintaining a blissful state,

source: །ཡེ་ཤེས་ཀྱི་ནི་མཚོན་གྱིས་བཅད།
en: I cut with the sword of wisdom.

source: །རྫུ་འཕྲུལ་རྐང་པ་གནས་ཡིན་ཏེ།
en: I stand on the base of magical power,

source: །ཞི་གནས་དག་ནི་འཛིན་སྟངས་ཡིན།
en: And cessation is my clenched fist.

source: །ཚུལ་ཁྲིམས་ཤིང་རྟ་སྒྲ་སྙན་ལ།
en: “Conduct is my chariot, which makes a pleasing sound,

source: །ང་ཡི་ལྷག་མཐོང་ཁ་ལོ་སྒྱུར།
en: And my observation is a charioteer.

source: །བཟོད་དང་དེས་པའི་གོ་བགོས་ནས།
en: Clad in armor, which is patience and gentleness,

source: །ལམ་བསྒོམས་པས་ན་གཡུལ་ངོར་ནི།
en: I go to the battlefield by practicing the path.

source: །གང་གིས་སྒྲིབ་པ་འཇོམས་པ་ཡི།
en: “With a quiver,

source: །དབང་པོ་ལྔ་ཡི་དོང་བ་དང་། །གང་གི་ཉོན་མོངས་ཐག་འཇུད་པའི།
en: Which is the five faculties that destroy obstacles,

source: །ཡང་དག་སྤོང་བ་བཞི་པོ་ཡིས།
en: And the four kinds of correct relinquishment, Which kill defilements,

source: །ངས་ནི་དཔའ་བོ་གཡུལ་སྤྲད་དེ།
en: “I fought a heroic battle.

source: །བདུད་དཔུང་བཅས་པར་བཅོམ་བྱས་ཏེ།
en: And having defeated Māra with his army,

source: །ང་ནི་བྱང་ཆུབ་དབང་བསྐུར་རོ།
en: I was anointed as a king for awakening.

source: །རིག་པས་མ་རིག་བཅོམ་ནས་ནི།
en: “Having defeated ignorance with knowledge, I crossed the front line of battle,

source: །ཕུང་པོ་སྐྱེ་ཞིང་འཇིག་པ་ཅན།
en: Where the five aggregates arise and cease.

source: །གཡུལ་གྱི་རྩེ་མོ་རྒལ་ཏེ་ང་། །སྐྱེ་དགུ་བྱང་ཆུབ་ཕྱིར་སངས་རྒྱས།
en: I was awakened for the awakening of beings.

source: །གང་གི་སྐྱེ་དགུ་གནོད་བྱེད་པ།
en: “Since I have completely defeated

source: །འཇིག་རྟེན་ཆོམ་རྐུན་ཆེན་པོ་གསུམ།
en: The worst three thieves in the world Disturbing humans,

source: །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་རྣམས། །དེ་ཀུན་ང་ཡིས་བཅོམ་པས་ན།
en: Who are desire, hatred, and delusion,

source: །མངོན་ཤེས་ཀུན་གྱི་སྟོབས་བྱུང་བས།
en: “The power of all supernormal knowledge has arisen in me.

source: །ང་ནི་དགྲ་བཅོམ་ཡོན་གནས་འོས། །ཞིང་གཤིན་པ་ལ་ཞུགས་པ་ཡི།
en: I am an arhat, who is suitable to be a field of merit,

source: །སྦྱིན་སྲེག་རྣམས་ཀྱང་ལེན་པ་ཡིན།
en: Recipient of offerings That have grown in a good field.

source: །བརྩོན་འགྲུས་དམ་པ་བརྩམས་ནས་ནི།
en: “Having made the best effort,

source: །ངས་ནི་ཟག་པ་རྣམས་བཅོམ་མོ།
en: I defeated impurities.

source: །ཆུ་བོ་ཆེ་ལས་རྒལ་ནས་ནི།
en: Having crossed the great flood,

source: །བསྒྲལ་བའི་ཕྱིར་ནི་གནས་པ་ཡིན།
en: I remain to allow others to cross.”

source: །ཇི་ལྟར་སེང་གེ་མཆེ་བའི་སྟོབས།
en: “Just as a lion with powerful fangs,

source: །ནགས་སུ་སྲོག་ཆགས་དང་ཕྲད་ནས།
en: When it meets other beings in the forest,

source: །ཆུང་དང་འབྲིང་དང་ཆེན་པོའང་རུང་།
en: Whether they are small, medium, or large,

source: །དེ་ལ་མཚུངས་པར་སྣུན་པ་ལྟར།
en: Pounces on them equally,

source: །མི་ཡི་སེང་གེ་རྣམ་འདྲེན་པ།
en: “The lion among humans, the Leader,

source: །རྫོགས་སངས་དེ་བཞིན་འཇིག་རྟེན་ནི།
en: The Perfectly Awakened One in the world,

source: །བྱིས་པའམ་འབྲིང་ངམ་ཆེན་པོ་ལ། །མཉམ་པོར་ཆོས་ནི་སྟོན་པར་མཛད།
en: Equally shows the Dharma To those who are immature, middling, and great.

source: །གཽ་ཏམ་ཁྱོད་ཀྱིས་འདི་རུ་ནི།
en: “O Gautama, here may you

source: །ནད་པ་བདག་ནི་ཐེ་ཚོམ་སོལ།
en: Remove my uncertainties, I who am sick!

source: །ཟུག་རྔུ་འབྱིན་པ་རྣམས་དང་ནི།
en: The best of those who remove pain,

source: །མིག་མཁན་རྣམས་ཀྱི་མཆོག་ཁྱོད་ལགས།
en: Those who perform surgery, is you.”

source: །ཁྱོད་ཀྱི་ཐེ་ཚོམ་བསལ་བར་བྱས།
en: “Remove your uncertainties!

source: །བྲམ་ཟེ་ཁྱོད་ནི་འདུན་པར་གྱིས། །གྲགས་ལྡན་རྫོགས་པའི་སངས་རྒྱས་རྣམས། །མཐོང་བ་རྙེད་པར་དཀའ་བ་སྟེ།
en: Brahmin, you should be zealous. It is difficult to see Celebrated perfectly awakened ones. “The Perfectly Awakened One,

source: །གང་ཞིག་འདི་ན་རྙེད་དཀའ་བ། །བརྒྱ་ལམ་ན་ནི་ལན་འགའ་འབྱུང་།
en: Who is difficult to meet and appears very rarely,

source: །བྲམ་ཟེ་རྫོགས་པའི་སངས་རྒྱས་ང་།
en: Is me, brahmin;

source: །ཆོས་ཀྱི་རྒྱལ་པོ་བླ་མེད་ཡིན།
en: I am the supreme king of the Dharma.”

source: །དེ་བཞིན་གཤེགས་ལ་རིས་གསོལ་བ།
en: Śaila said to the Tathāgata, “O Gautama, if you say

source: །རྫོགས་སངས་རྒྱས་ཞེས་བཀའ་སྩལ་ཏེ།
en: That you are the Perfectly Awakened One

source: །མ་འདྲེས་འཁོར་ལོ་སྐོར་མཛད་ན།
en: And you turn the chakra everywhere, “Who is the general,

source: །གཽ་ཏམ་ཇི་སྐད་གསུང་བ་བཞིན།
en: The disciple born from the Teacher himself,

source: །ཁྱོད་ཀྱིས་འཁོར་ལོ་བསྐོར་བ་གང་། །རྗེས་སུ་མཁས་པར་བསྐོར་བགྱིད་པ། །སྟོང་པ་ཉིད་འཁྲུངས་ཉན་ཐོས་ནི།
en: Who wisely turns the chakra once turned by you

source: །སྡེ་དཔོན་དག་ཏུ་སུ་འགྱུར་ལགས།
en: As you taught?”

source: །བྲམ་ཟེ་ང་ལ་ཉན་ཐོས་ནི། །ཤེས་རབ་མཚུངས་པའི་སྲས་ཡོད་པ། །ཉེ་རྒྱལ་ཞེས་ནི་གྲགས་པ་པོ།
en: “Brahmin, I have a disciple, A son, who is equal to me in wisdom:

source: །མང་དུ་ཐོས་པ་ཤཱ་རིའི་བུ།
en: The well-learned Śāriputra, Also called Upatiṣya.

source: །མདུད་པ་ཀུན་ལས་རྣམ་གྲོལ་བ།
en: “He is liberated from all the knots,

source: །ཉེར་ཞི་ཟག་པ་མེད་ཡོད་དེ།
en: Peaceful, free from impurities. Being wise, he turns

source: །ངས་ནི་འཁོར་ལོ་གང་བསྐོར་བ། །མཁས་པ་རྗེས་སུ་སྐོར་བར་བྱེད།
en: The chakra I have turned.”

source: །ཨེ་མའོ་སངས་རྒྱས་ཆོས་དང་ནི།
en: “How wonderful the Buddha and the Dharma are!

source: །ཨེ་མའོ་ཉན་ཐོས་ཕུན་སུམ་ཚོགས།
en: How wonderful the perfection of the disciples is!

source: །ཨེ་མའོ་རིན་ཆེན་དམ་པ་གསུམ།
en: How wonderful the most excellent three treasures are!

source: །འཇིག་རྟེན་བྱུང་བ་ངོ་མཚར་ཆེ།
en: A great marvel has appeared in the world. “Excellent One, approved as

source: །བཟང་པོ་ཁྱོད་ཀྱི་ཉན་ཐོས་སུ། །བདག་གིས་གཡར་གྱིས་བླང་བགྱིས་ལ།
en: A disciple of yours,

source: །ཀྱེ་མའོ་ཆོས་ཀྱི་བཅུད་འཚལ་ནས།
en: I will drink the essence of the Dharma—how great!—

source: །ཤིན་ཏུ་མྱ་ངན་འདས་པར་བགྱི།
en: And successfully become emancipated.”

source: །སེམས་རྟོག་རབ་ཏུ་དགའ་གྱུར་ནས།
en: After his mind was pleased,

source: །དེ་ནས་བྲམ་ཟེ་སྐྱོ་གྱུར་ཏེ།
en: Then the brahmin became stirred up. He said to his attendants,

source: །དབེན་པ་འདོད་པའི་སེམས་ཀྱིས་ནི།
en: With his mind seeking solitude, “Listen, sirs, to the words That the great meditator,

source: །འཁོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The remover of pain, the seer, has given,

source: །ནགས་ན་སེང་གེ་སྒྲ་འབྱིན་ལྟར། །བསམ་གཏན་ཆེན་པོའི་ཟུག་རྔུ་འབྱིན། །སྤྱན་དང་ལྡན་པས་ཅི་གསུངས་པ།
en: Just as a lion roars in the forest.

source: །འདི་ནི་ཤེས་ལྡན་དག་ཉོན་ཅིག །གང་དག་འདོད་པ་རྗེས་སུ་སོང་།
en: “Those who wish should follow me;

source: །གང་དག་མི་འདོད་དེ་དག་དེང་།
en: Those who do not should leave.

source: །ཤེས་རབ་མཆོག་གི་བསྟན་པ་ལ། །དེ་རིང་ཁོ་ན་རབ་འབྱུང་ངོ་།
en: I will go forth today In the teachings of the possessor of the most excellent wisdom.

source: །ཚངས་སྤྱོད་འདི་ལ་ལེགས་སྤྱད་ཅིང་།
en: “If one leads this pure life

source: །ལམ་ཉིད་ཤིན་ཏུ་གོམས་བྱས་ན། །བག་ཡོད་པ་ལ་གནས་པ་ཡི།
en: And practices the path well,

source: །རབ་བྱུང་འབྲས་བུ་བཅས་པར་འགྱུར།
en: His going forth will be fruitful For himself, who practices carefulness.”

source: །གལ་ཏེ་ཁྱེད་ཅག་རབ་འབྱུང་ཞིང་། །བསྙེན་པར་རྫོགས་པར་འདོད་ན་ནི།
en: “If you wish to go forth

source: །བྲམ་ཟེ་རལ་པ་འདི་བྲེགས་ཏེ།
en: And be ordained,

source: །བདག་ཅག་རབ་ཏུ་འབྱུང་བར་བྱ།
en: O brahmin, we too will go forth, Cutting off these locks of hair.”

source: །སེམས་རྟོག་རབ་ཏུ་མགུ་གྱུར་པས།
en: With his mind pleased,

source: །སོར་མོ་བཅུ་ཡི་ཐལ་སྦྱར་ཏེ།
en: Making the gesture of supplication, his ten fingers joined,

source: །བླ་གོས་ཕྲག་པ་གཅིག་གཟར་ནས།
en: With his upper robe draped over one shoulder,

source: །བྲམ་ཟེ་རི་བོ་དེས་གསོལ་པ།
en: The brahmin Śaila said,

source: །བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་པོ།
en: “These five hundred young brahmins

source: །འདི་དག་ཐལ་སྦྱར་འཁོད་པ་ནི།
en: Are making the gesture of supplication.

source: །ཐུབ་ཆེན་རབ་ཏུ་འབྱུང་བ་དང་། །བསྙེན་པར་རྫོགས་པ་ཐོབ་པར་འཚལ།
en: O Great Muni, we all wish to Go forth and be ordained.”

source: །དེ་ནས་སྟོན་པ་ཐུགས་རྗེ་ཅན།
en: Then, the merciful Teacher,

source: །དྲང་སྲོང་ཆེན་པོ་ཐུགས་བརྩེ་བས།
en: The compassionate great ṛṣi,

source: །དེ་དག་བསྙེན་པར་རྫོགས་པར་གྱུར།
en: Thus they were ordained.

source: །རྫུ་འཕྲུལ་ལྡན་པ་མཽད་གལ་དང་། །དགའ་ཡོད་གནས་བརྟན་ཀ་པི་ན།
en: Maudgalyāyana, who possessed magical power, The elder Nandika Kapphiṇa, Who was conversant in eloquence—

source: །སྤོབས་པ་རྟོགས་པར་ཁོང་དུ་ཆུད།
en: These elders skilled in eloquence Instructed them

source: །ཆུ་བོ་བཟང་པོའི་འགྲམ་དུ་ནི། །ཡིད་དུ་འོང་བའི་ཚལ་ཁྲོད་དུ། །སྤོབས་པ་བྱང་བའི་གནས་བརྟན་གྱིས།
en: In the pleasant forest On the bank of the Prabhadrikā River.

source: །དེ་དག་ལ་ནི་གདམས་ངག་ཕོག །དེར་ནི་དེ་ལས་ཆོས་ཀྱི་གཏམ།
en: There, having learned from them the discourse of the Dharma

source: །རྗེས་སུ་མཐུན་པ་དེ་ཤེས་ནས།
en: That was suitable for them,

source: །རིང་པོ་མ་ཐོགས་རྣམ་གྲོལ་ཏེ།
en: The monks were soon liberated

source: །དམ་པའི་དོན་ལ་རབ་ཏུ་བཀོད།
en: And were established in the supreme goal.

source: །དེ་དག་མཐོང་ཐོབ་བདེ་གྱུར་པས།
en: Having seen such profit and become happy, They were emancipated in those very lives.

source: །མཐོང་བའི་ཆོས་ལ་མྱ་ངན་འདས།
en: Delighted, they worshiped
